In [1]:
#Python to MySQL connect

In [3]:
import pymysql as py
print('Done')

Done

In [5]:
!pip install PyMySQL

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: PyMySQL in c:\users\chana\appdata\roaming\python\python312\site-packages (1.1.1)

In [4]:
conn = py.connect(user = 'root',
           password='1st march 2006',
           host = 'localhost',
           autocommit = True)

print('Connection Created Successfully')

Connection Created Successfully

In [5]:
cur = conn.cursor()
print('Done')

Done

In [6]:
#create database using python

In [7]:
query = '''create database IITM_day5;'''


cur.execute(query)
print('done')

ProgrammingError: (1007, "Can't create database 'iitm_day5'; database exists")

In [8]:
query = '''USE  IITM_day5;'''


cur.execute(query)
print('done')

done

In [9]:
query = '''create table student_details
(
SID int not null,
student_name varchar(50),
course varchar(50),
Address varchar(100),
Scholarship float
);'''

cur.execute(query)
print('done')

done

In [11]:
query = '''insert into student_details
values
(101,"Mohan Sharma","BCA","Delhi",5000.51),
(105,"Daksh Chanana","MCA","Delhi",4899.98),
(102,"Raju Rastogi","MBA","Delhi",1000.3),
(107,"Mohan Gulati","BTECH","UP",2000);
'''

cur.execute(query)
print('done')

done

In [16]:
sid = int(input('Enter your student id'))
name = input('Enter your name')
course = input('Enter your choosed course')
address = input('Enter your address')
scholarship = float(input('Enter your scholarship amount'))

q = f'''insert into student_details values
({sid},"{name}","{course}","{address}",{scholarship});'''

cur.execute(q)
print('Done')

Enter your student id 1245
Enter your name Daksh
Enter your choosed course BCA
Enter your address dElhi
Enter your scholarship amount 1500

Done

In [18]:
n = 3
for n in range(n):
    sid = int(input('Enter your student id'))
    name = input('Enter your name')
    course = input('Enter your choosed course')
    address = input('Enter your address')
    scholarship = float(input('Enter your scholarship amount'))
    
    q = f'''insert into student_details values
    ({sid},"{name}","{course}","{address}",{scholarship});'''
    
    cur.execute(q)
    print('Record Insertesd Successfully')
print('Done')

Enter your student id 56
Enter your name Harsh
Enter your choosed course BCA
Enter your address delhi
Enter your scholarship amount 1500

Record Insertesd Successfully

Enter your student id 45
Enter your name Gajodhar
Enter your choosed course BOTONY
Enter your address KASOL
Enter your scholarship amount 600000

Record Insertesd Successfully

Enter your student id 548
Enter your name GFDD
Enter your choosed course BCA
Enter your address RUSSIA
Enter your scholarship amount 60000000000000000

Record Insertesd Successfully
Done

In [28]:
query = "select * from student_details;"

cur.execute(query)

records = cur.fetchall()

import pandas as pd
pd.DataFrame(records,columns = all_columns)

     SID   student_name  course   Address   Scholarship
0    101   Mohan Sharma     BCA     Delhi  5.000510e+03
1    105  Daksh Chanana     MCA     Delhi  4.899980e+03
2    101   Mohan Sharma     BCA     Delhi  5.000510e+03
3    105  Daksh Chanana     MCA     Delhi  4.899980e+03
4    102   Raju Rastogi     MBA     Delhi  1.000300e+03
5    107   Mohan Gulati   BTECH        UP  2.000000e+03
6   1245          Daksh   Delhi       BCA  1.500000e+03
7   1245          Daksh     BCA     dElhi  1.500000e+03
8   1245          Ayan'     MBA        UP  1.000000e+02
9   1256         Rachit     BCA     PATNA  1.500000e+03
10  1345         Govind   BTECH  Himachal  1.345000e+03
11    56          Harsh     BCA     delhi  1.500000e+03
12    45       Gajodhar  BOTONY     KASOL  6.000000e+05
13   548           GFDD     BCA    RUSSIA  6.000000e+16

In [29]:
all_columns = []
for i in cur.description:
    all_columns.append(i[0])

In [31]:
query = "select * from student_details;"

cur.execute(query)

records = cur.fetchall()

import pandas as pd
df = pd.DataFrame(records,columns = all_columns)
df

     SID   student_name  course   Address   Scholarship
0    101   Mohan Sharma     BCA     Delhi  5.000510e+03
1    105  Daksh Chanana     MCA     Delhi  4.899980e+03
2    101   Mohan Sharma     BCA     Delhi  5.000510e+03
3    105  Daksh Chanana     MCA     Delhi  4.899980e+03
4    102   Raju Rastogi     MBA     Delhi  1.000300e+03
5    107   Mohan Gulati   BTECH        UP  2.000000e+03
6   1245          Daksh   Delhi       BCA  1.500000e+03
7   1245          Daksh     BCA     dElhi  1.500000e+03
8   1245          Ayan'     MBA        UP  1.000000e+02
9   1256         Rachit     BCA     PATNA  1.500000e+03
10  1345         Govind   BTECH  Himachal  1.345000e+03
11    56          Harsh     BCA     delhi  1.500000e+03
12    45       Gajodhar  BOTONY     KASOL  6.000000e+05
13   548           GFDD     BCA    RUSSIA  6.000000e+16

In [36]:
def show_records(db,table):

    query = f'''select * from {db}.{table};'''
    
    cur.execute(query)
    
    records = cur.fetchall()

    all_columns = []
    for i in cur.description:
        all_columns.append(i[0])

    
    import pandas as pd
    df = pd.DataFrame(records,columns = all_columns)
    return df

In [38]:
show_records('iitm_day5','student_details')

     SID   student_name  course   Address   Scholarship
0    101   Mohan Sharma     BCA     Delhi  5.000510e+03
1    105  Daksh Chanana     MCA     Delhi  4.899980e+03
2    101   Mohan Sharma     BCA     Delhi  5.000510e+03
3    105  Daksh Chanana     MCA     Delhi  4.899980e+03
4    102   Raju Rastogi     MBA     Delhi  1.000300e+03
5    107   Mohan Gulati   BTECH        UP  2.000000e+03
6   1245          Daksh   Delhi       BCA  1.500000e+03
7   1245          Daksh     BCA     dElhi  1.500000e+03
8   1245          Ayan'     MBA        UP  1.000000e+02
9   1256         Rachit     BCA     PATNA  1.500000e+03
10  1345         Govind   BTECH  Himachal  1.345000e+03
11    56          Harsh     BCA     delhi  1.500000e+03
12    45       Gajodhar  BOTONY     KASOL  6.000000e+05
13   548           GFDD     BCA    RUSSIA  6.000000e+16